[{"pk": 1, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Activities", "url": "/Activities.html", "template_name": "", "sites": [1], "content": "<p>Swinging activities can include (but are not limited to):</p>\r\n<ul>\r\n<li><b>Exhibitionism</b>: having sex with a partner while being watched.</li>\r\n<li><b>Voyeurism</b>: watching others have sex (perhaps with the above mentioned partner).</li>\r\n<li><b>Soft Swinging</b> or <b>Soft Swap</b>: kissing, stroking, or having oral sex with a third or fourth person. This may be in the form of a threesome or group sex, or partners may literally be swapped.</li>\r\n<li><b>Full Swap</b>: having penetrative sex with someone other than one's partner, which is the commonly understood definition of swinging (though not necessarily the most common type).</li>\r\n<li><b>Group Sex</b>: An all inclusive term for activities involving multiple partners in the same vicinity.</li>\r\n</ul>\r\n<p>Typically, swinging activities occur when a married or otherwise committed couple engages with either another couple, multiple couples, or a single individual. These acts can occur in the same room (often called <b>same room</b> swinging) though <b>different</b> or <b>separate room</b> swinging does occur. Sex on these occasions is often referred to as <b>play</b>.</p>\r\n<p>While the vast majority of <b>swingers</b> are heterosexual couples, a major part of <b>Lifestyle</b> activities are bisexual in nature. A large portion of female swingers, while they may or may not identify as bisexual, are interested in female-female sexual contact. Male-male contact is very rare, and usually never allowed in at a Swing Club/Party.", "enable_comments": false}}, {"pk": 14, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Best countries for sex tourism", "url": "/best.html", "template_name": "", "sites": [4], "content": "\t\t\t<h1>20 best destinations for sex tourism</h1>\r\n\r\n<p>Date with ladies in:<br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Thailand\">Thailand</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Philippines\">Philippines</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Cuba\">Cuba</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Russia\">Russia</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Latvia\">Latvia</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Brazil\">Brazil</a><br>\r\n\r\n\r\n<p>You're going to visit a country where girls are hanging on you right after you leave the plane? You're lucky! But even the luckiest of us have bad days. To avoid risk staying alone, find potential partners beforehand - search for hot local girls online, contact them, make a list and don't forget to take it with you! Have maximum of fun, wherever you go! <a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M\">AdultFriendFinder will demonstrate your hundreds of profiles of sexiest women - choose a location and desirable parameters</a>!\r\n\r\n\t\t\t<h3>Asia</h3>\r\n\t\t\t<p>In the late 70th tourists expanded to Southeast Asia. Thailand, Cambodia, Philippines,  Shangri-la, Bali - they became popular because of low price of different services including sex. Search for you \"love\" in Boracay gogo bars or in Bali brothel - sex in boracay as well as in other cities of Asia is cheap and enjoyable. Best hookers can be meet everywhere in Asia, best brothels here and where, it's just the right destination for any sexpat.\r\n\t\t\t<p>There are rainy seasons in Asia, but they are not dangerous and annoying. They are quite refreshing, so it's hard to say when it's the best time to go Bali or Cambodia. It's equally hard to decide which Asian destination is best. It's up to you!\r\n\t\t\r\n\t\t\t<p>Asian sweethearts aren't against of having sex with couple or female, so it's a paradise for swingers and lesbians. There are lot of guys working in sex industry, too, so gay travelers can spend a time with interest, also. So it's really the best sexual tourism destination.\r\n\t\t\t<p>Brothels, massage parlors, go-go bars, pool bars and beaches flooded with girls ready to serve for a minimum price, that's why Thailand, Cambodia, Philippines,  Shangri-la, Bali are the best countries for sex and prostitution. Be aware: some of beautiful Thai ladies can be male, transvestite (katoey).\r\n\r\n\t\t\t<h3>Thailand:</h3>\r\n\t\t\t<p>Low cost of living and meals, safety, general convience and plenty of girls - what else can a man want?\r\n\t\t\tMeet your beauty at the bar, playing pool, or in the club, dancing on the stage as go-go dancer. They all look for clients, and mamasan will gladly help to choose the best match. Often one needs to pay a bar fine to take a girl out of bar. Some bars have rooms for a short-time rent.\r\n\t\t\t<p>You can take a girl for a short time - for a few hours, or long time - for a night. First you need to pay barfine - except you'd like to take a girl for short-time only. Barfine in Bangkok, Phuket, Pattaya and other popular places isn't high, less than $15.\r\n\t\t\tShort-time prices start from 500 Baht ($13), long time from 1000 Baht. Girl gladly suggest you to spend all your vacation together - the price is average, and services can be extremely good. Don't forget to tip her after short-time rest!\r\n\r\n\t\t\t<h4>Beer bars.</h4>\r\n\t\t\t<p>All hostesses try to find customers, calling them at streets, look bored. Prices are not high.\r\n\t\t\tGo-go bars are another thing, girls look better than in beer bars, but they ask for more money and look for better clients. \r\n\t\t\t<p>There also \"blowjob bars\" which is curious to visit and get care while drinking.\r\n\t\t\t<p>Ladyboys (kathoey) often look amazing and feminine, men easily mistake them with girls. Ladyboys often are dangerous - they can steal money at street and especially from a hotel room.\r\n\t\t\t<p>Take some time (while you are sober) to learn how to tell them apart from regular women. Things to look for are: how they walk, their height, their adams apple, a larger head, larger hands, a mustache or beard starting to show, a squeaky type of voice.\r\n\r\n\t\t\t<p>Bringing a guest into your hotel, make sure that reception wrote down his/her id number.\r\n\t\t\tSome aspects of prostitution in Thailand are illegal, but enforcement is lax (the loitering/soliciting fine is 200 baht) and brothels are spreaded widely. It's not illegal to pay for sex or to pay a \"bar fine\". \r\n\r\n\t\t\t<h4>Best place for sex in Thailand:</h4>\r\n\t\t\t<p>Best brothels in Thailand are located in well-developed tourist places. Body massage (bath massage) can be found in Bangkok, Pattaya. Phuket.\r\n\t\t\t<p>Bangkok: Patpong, lower Sukhumvit Road area including Nana plaza, Soi Cowboy.\r\n\t\t\t<p>Pattaya: Beach Road, 2nd Road, Walking Street, Boyz town (for gays and women). On the central beach you will find freelancers, 2nd Road and Beach Road are flooded with beer bars, Walking Street - with go-go bars and pussy shows. Massage parlors are located on 2nd Road: Sabai Land, Sabai Room, and Sabai Dee. Pattaya brothels\r\n\t\t\t<p>Phuket: Patong Beach and Bangla Road full of sex clubs, check them out.\r\n\t\t\tIn other tourist areas look for \"body massage\" signs.\r\n\t\t\tIt's incredibly hard to find a prostitute on small island like Koh Larn, so take a girl with you if you're going to visit islands.\r\n\r\n\t\t\t<h3>Cambodia</h3>\r\n\t\t\t<p>If you're in Pattaya, come and visit Cambodia that is not far away. You can find here something special, up to $50/night.\r\n\r\n\t\t\t<h3>Taiwan, South Korea, Vietnam</h3>\r\n\t\t\t<p>These countries are also very inviting for different kind of tourists and gladly offer sex service for cheap.\r\n\r\n\t\t\t<h3>Philippines</h3>\r\n\t\t\t<p>Massage parlors, brothels (casas) sell sex at affordable prices. Clubs and bars are comfortable to have a lady's drink and spend time in VIP room. Escort Service is available - girl would accompany men in trip all the time, including nights. This service is popular in Puerto Galera, Palawan and Boracay.\r\n\t\t\t<p>Find the best places for Manila hookers and have good time. Forget of them and look for new on your next visit - girls move from one gogo bar in Manila to another one quickly. By the way, barfine in Philipines is only $10-20, depending on time you'd like to spend with your new girlfriend. Manila is quite expensive comparing with other destinations in Asia, and if you looking for cheap sex vacation, go to Angeles city, where philippina cuties in some gentlemen's club will treat you as husband. You can get blowjob from Angeles city hooker very cheap, it cost less than 200-300 pesos, sex is 400-500 pesos.\r\n\r\n\t\t\t<h3>The Caribbean and Latin America</h3>\r\n\t\t\t<p>The Caribbean are most known as the best destination for female sex tourism, but it has something to seduce men.\r\n\r\n\t\t\t<h3>Cuba</h3>\r\n\t\t\t<p>Girls on Cuba are friendly and contact with foreigners easily, though know English not very well. Go out and see how many of Cubian beauties want to spend time with you. Prostitution is a family business, so mother or brother will sell a girl for hour or night and invite such guest to have fun in their own house while rest of the family will sleep or do their own things. So why check best cubian brothels if you can try a cubian pussy almost anywhere?\r\n\r\n\t\t\t<h3>Jamaica</h3>\r\n\t\t\t<p>Lot of beauties look for clients in the night. They ask if you want them (just say yes). Be ready to pay $50.\r\n\r\n\t\t\t<h3>Brazil</h3>\r\n\t\t\t<p>For long time Brazil was known as leader of the region in sex tourism sphere, but now Costa Rica, Guatemala, and Honduras can compete with it. Variety of pretty girl for any taste. Prostitution is officially prohibited, but there are bath-houses and clubs of help there you will be provided with sex service, as they as operate as brothels. Also, remember that Latin girls are open-minded and friendly, so no wonder if someone will like you just because of your handsomeness ;)\r\n\r\n\t\t\t<h3>Dominican Republic</h3>\r\n\t\t\t<p>This country has landscapes incredible in it's beauty, but lonely guys from around the world come here not only for that. They seach for easy love for little money.\r\n\t\t\t<p>At discos there are lot of prostitutes looking for men, some of them can speak English and German well. At some main streets prostitutes open hunt for guys, touching and embarrassing them. These also can be pickpockets.\r\n\t\t\t<p>It's hard not to notice those women, but there are also massage parlors, strip clubs and brothels in the country. You can hire a girl from strip club, paying an exit fee previously. Bringing a girl to the hotel is acceptable if she has an ID.\r\n\t\t\t<h3>Best places in Dominica for sex tourism: Boca Chica, Sosua.</h3> \r\n\t\t\t<p>Beware: some of girl can use drugs and steal values from you or your room. \r\n\r\n\t\t\t<h3>The Nitherlands</h3>\r\n\t\t\t<p>Popular national destinations for sex tourists include The Netherlands,  Amsterdam and Rotterdam. Red Light Districs, prostitutes of different races, Amsterdam best brothels, prices aren't low, but along with light drugs it's all for good.\r\n\t\t\t<p>No sexual taboos exist in the Netherlands.\r\n\r\n\t\t\t<h3>Eastern Europe</h3>\r\n\t\t\t<p>Since the collapse of the Iron Curtain, Russia, Hungary, Ukraine, Bulgaria, Poland and the Czech Republic have also become popular destinations for sex tourism.\r\n\t\t\t<p>In Czech Republic most of sex workers are foreign girls from neighbour countries. They come out at evening and flood popular tourist places. Prices start at $20 per hour. You also can visit a brothel, which are very nice and clean, girls can speak English. One can call them best brothels in Eastern Europe.\r\n\t\t\t<h4>Popular Prague clubs:</h4>\r\n\t\t\t<p>Venuse, Lotos, Butterfly, Gentlemen's Club, Million Dollars, Kleopatra.\r\n\t\t\t<p>Hungurian is known for it's porn movies, and girls in paper ads look just like porn stars. Call them. Also visit sex-cinema which is popular in Hungary.\r\n\t\t\t<p>Ukraine and Russia are popular destinations for romantic tours, where men look not only for sex but firstly for wives. However, disonest guys use that opportunities for sex tourism (almost free). Prostitutes take not less than $50 per hour, $100 per night. Sex tourists from Turkey seeking cheap sex and prostitutes have good time at Ukrainian resorts like Crimea and Yalta.\r\n\r\n\t\t\t<h3>Latvia</h3>\r\n\t\t\t<p>Fresh-looking girls walk the streets at evening, helping tourists to find popular public places and discos. They gladly accompany European tourists and make love for a small reward. Special catalogues with girls' info and contact telephone are distributed in Riga. After all, any night bar or striptease club have info where to find a girl for one-night stand. Prostitution is legal, so there are many brothels in big cities like Riga, women are obliged to go through health-check regularly.\r\n\r\n\t\t\t<h3>Poland</h3>\r\n\t\t\t<p>Girls are beautiful and offer good service. Prices aren't as low as you may desire.\t\t\t\r\n\r\n\t\t\t<h3>Austria</h3>\r\n\t\t\t<p>Postitution in Austria is legal and girls can obtain this work from 14 y.o. Specialized magazines with hookers' photo and info and sex guides are issued and sold, the same info are being printed in ordinary press and magazines. \r\n\r\n\t\t\t<p><p>Related subjects: best brothels in Brazil, Thailand, best European country for prostitution, best escort service for low fees for men, prostitution in jalta, ukraine brothels", "enable_comments": false}}, {"pk": 7, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Bisexuality", "url": "/Bisexuality.html", "template_name": "", "sites": [1], "content": "<p>Female bisexuality and bicuriousity is common in both the urban and traditional swinging scene and tends to be the norm amongst participants. No studies have been conducted as to what percentage of swinging women who define themselves as bisexual would be open to romantic as well as sexual relations with both genders.</p>\r\n<p>Male bisexuality is less common in the swinging scene. More openly bi men and bisexual couples (male-female couples where both partners are bisexual) are appearing on the scene. Whether this is due to increasing acceptance in the scene or greater numbers of men \"turning bi\" is open to discussion. Depending on the club or social situation male bisexuality among swingers may either be frowned upon, or openly accepted.</p>", "enable_comments": false}}, {"pk": 24, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Books", "url": "/books.html", "template_name": "", "sites": [4], "content": "\t\t\t<h1>Books about sex tourism</h1>\r\n\t\t\t<ul>\r\n\t\t\t\t<li>Michel Houellebecq, Platform \r\n\t\t\t\t<li>Josey Miller, Romance on the Road\r\n\t\t\t\t<li>Anne Cumming, The Love Habit and The Love Quest\r\n\t\t\t\t<li>Fiona Pitt-Kethley, The Pan Principle and Journeys to the Underworld\r\n\t\t\t\t<li>Cleo Odzer, Patpong Sisters\r\n\t\t\t\t<li>Lucretia Stewart, The Weather Prophet\r\n\t\t\t\t<li>Erica Jong, Fear of Flying.\r\n\t\t\t\t<li>Howard L. Hughes, Pink Tourism: Holidays of Gay Men and Lesbians\r\n\t\t\t\t<li>Kamala Kempadoo, Sun, Sex, and Gold: Tourism and Sex Work in the Caribbean\r\n\t\t\t\t<li>Karen Kelsky, Women on the Verge: Japanese Women, Western Dreams\r\n\t\t\t\t<li>Jeremy Seabrook, Travels in the Skin Trade: Tourism and the Sex Industry\r\n\t\t\t</ul>", "enable_comments": false}}, {"pk": 8, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Dogging", "url": "/Dogging.html", "template_name": "", "sites": [1], "content": "Dogging is a British term for swinging based in cars that takes place in a public but reasonably secluded area. There are several known dogging spots across the UK where people go after dark, typically to engage in voyeurism and exhibitionism but also to take part in group sex.", "enable_comments": false}}, {"pk": 6, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Etiquette", "url": "/Etiquette.html", "template_name": "", "sites": [1], "content": "<p>The 'prime directive' in swinging is \"no means no\". This means that rejection of a sexual advance does not require justification and must always be respected. Respect for one's play partners is often a hallmark of swinging activity, and violation of this directive can result in immediate expulsion. Concordantly, in the US it is often regarded as impolite to touch without asking, whereas in the UK and Europe both touching and gently but firmly removing a touching hand are widely regarded as polite non-verbal communication in the playroom context.</p>\r\n<p>Many swingers who participate in penetrative sex whilst swinging are strict about condom usage, including insisting on changing condoms between partners. However, some members of the swinging community do engage in unprotected sex, in a practice that is commonly known as barebacking. When unsure, it is considered a polite necessity to establish these ground rules before becoming sexually involved.</p>\r\n<p>Some swingers believe that it's possible to spot others in the same way that Gaydar is supposed to work (sometimes referred to as <i>Playdar</i>), while others may rely on more overt signs. Among homosexual communities, a traditional means to identify one another was a single earring in the right ear; however, currently, there is no commonly used method for identifying swingers. Some believe that actions such as a woman being flirtatious while their significant other is present, men who offer their wives to dance or couples entering a bar separately and spending the evening apart are ways to tell if a couple swings. Obviously, these signs, both subtle and overt, are difficult to perceive, and swingers are often averse to identifying themselves in public. The growth of many swinging web sites on the Internet is partly due to this, allowing swingers to communicate and meet without public attention or the risk of offending non-swingers.</p>", "enable_comments": false}}, {"pk": 16, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Female sex tourism", "url": "/female.html", "template_name": "", "sites": [4], "content": "\t\t\t<h1>Female sex tourism</h1>\r\n\r\n<!-- <p>Find a man of your dream in:<br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=M-F&country=Greece\">Greece</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=M-F&country=Turkey\">Turkey</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=M-F&country=Bali\">Bali</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=M-F&country=Dominican Republic\">Dominican Republic</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=M-F&country=Kenya\">Kenya</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=M-F&country=Jamaica\">Jamaica</a>\r\n\r\n<p>Make you trip more interesting - contact local guys online, meet them in flesh when you come. You decide whom you like and what to do. <a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=M-F\">Use AdultFriendFinder to find hundreds of men in desirable location</a>! -->\r\n\r\n<p>Women enjoy traveling not less than men, and many of them want to have sex with inhavitants of countries they travel to. Women don't go straight ahead to buy a man for night, instead they go to sex shows, bars and etc. to meet there someone who isn't against of idea of having sex with female tourist. There exist special tours for such women, usually European or Scandinavian looking for fun with attractive beach boys.\r\n\r\n<p>Often women don't pay to boys for sex service with money, but buy them clothes, food, presents. However, there could be rates for male companionship, from $50 to $200. In some destinations, especially in Southern Europe, Turkey, Bali and the French Caribbean, men do not expect to be compensated.\r\n\r\n<p>Main destinations for female sex tourism are Southern Europe (Greece, Turkey and Spain), the Caribbean (Jamaica, Barbados and the Dominican Republic), the Gambia and Kenya in Africa, Bali and Thailand. Lesser destinations include Nepal, Morocco, Fiji, Ecuador and Costa Rica.\r\n\r\n<p>Guys ready to offer such service called kamakia in Greece (fishing harpoons), sharks in Costa Rica, rent-a-dreads and the Foreign Service in Caribbean, Kuta Cowboys or pemburu-bule in Bali (whitey hunters), Marlboro men in Jordan, bomsas or bumsters in Gambia, sanky pankies in Dominican Republic.\r\n\r\n<h3>History</h3>\r\n<p>Female sex tourism started in 1840ths, in Rome, along with first wave of feminism. Before that, there were single evidences of women visiting North America and Turkey in search of sex. \r\n\r\n<p>Until 1960ths it was hard time for traveling, so female sex tourism was affair only for brave women.In 60ths there was the second wave of sex tourism and European and Canadian women began explore the Caribbean, Greece, Latin America.\r\nIn 90ths Asian women from Japan and Taiwan started to look for sex partners in Bali and Thailand.\r\n\r\n<p>Nowadays women travel for sex everywhere where exist beaches and underemployed men. It's countries like Mexico, Morocco, Turkey, Nepal.\r\n\r\n<h3>Why women search sex in foreign countries?</h3>\r\n<p>In their mother countries women have to compete with men everywhere: in school, at work, in married life. It's called dating war and provoke women to look for sex far away from their home countries.\r\n<p>Another reason for vacation romance is being anonym. Men don't know them in real life, so women can act freely. There are no observers who call them whore. Women experiment with no fear, try new things.\r\n<p>Variety of men is another factor. New short-time romance help to cure after divorce or break-up.\r\n\r\n\r\n<h3>Dominican Republic</h3>\r\n<p>What women don't want to build relations with sexy, dark-skinned guy, even for a short time? Fun days and hot nights, even he lies, can make a woman feel much better if they take things easy. \r\n<p>Sankies are dominican gigolos, coming from poor families, with no education. They can be smart enough and know how to please women and play on her weakness.\r\n<p>Not all the guys who work on resorts are sankies. Usually sankies work in animation, as bartenders, waiters and etc. Their salary is low, so they hope to earn more with help of female tourists.\r\n<p>Asking a women out, sankie drink and dance, talk a lot with and become intimate with her. He can even pay for entertainment, because he wants a woman to trust him. Woman fall in love with him and supply contact with sanky even after getting back home.\r\n<p>Soon after that sanky start asking money for his ill mother or use another tricks, promising to send money back. In the mean time he assures a woman that he loves her madly and so on.\r\n<p>Another way of development of relation with sanky: he aims to get a visa our of his country. Receiving it, he breaks relations with a woman and begins a new life.\r\n\r\n<h4>Beware:</h4>\r\n<p>Many guys from tourist industry in other countries act the same way: build a romance, giving illusion of love and making female tourists come back to the resorts they work again and again. It can happen in Turkey, Egypt and other places.\r\n\r\n<h3>Jamaica</h3>\r\n\r\n<p>American, Canadian and European female tourists come to Negril, which is known as a \"swinging\" resort. Muscular guys care of middle-age tourists conquiring them with exotic look and mass of compliments. Those guys earn money to feed their families, as they can get up to $100 for sex with tourists and $150 for oral sex which is considered as taboo in this country.\r\n\r\n<h3>Cuba</h3>\r\n<p>Guys on Cuba can be unpleasently rood and hassling - they suggest their service and don't like being refused.\r\n\r\n<h3>Thailand</h3>\r\n<p>Pattaya and Phuket are definetely most popular among men coming into Thailand for sex, but women are able to find a sex and romantic here. Eeuropean women look for guys on Phuket and other islands. Female tourists get attracted by appearence of beach guys and guides - and these guys get attracted by tourists' money.\r\n\r\n<h3>Bali</h3>\r\n<p>Japanese women hire local guys for sex and pay them generously.\r\n\r\n<h3>Bulgaria</h3>\r\n<p>Mature German ladies like golden beaches of Bulgaria, where men are handsome and not asking for much. $25-50 per day.\r\n\r\n<p><p>African and Arabian giggolos often are happy to make love with women for no reward. They will be happy if woman feed and support them for a short time.", "enable_comments": false}}, {"pk": 20, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Gay sex tourism", "url": "/gay.html", "template_name": "", "sites": [4], "content": "\t\t<h1>Gay Tourism</h1>\r\n\r\n<p>Find a boyfriend in:<br>\r\n<a href=\"http://www.outpersonals.com/search/g668502-pct.subst?override=1&age=18-28&country=Australia\">Australia</a><br>\r\n<a href=\"http://www.outpersonals.com/search/g668502-pct.subst?override=1&age=18-28&country=Canada\">Canada</a><br>\r\n<a href=\"http://www.outpersonals.com/search/g668502-pct.subst?override=1&age=18-28&country=United%20States\">United States</a><br>\r\n<a href=\"http://www.outpersonals.com/search/g668502-pct.subst?override=1&age=18-28&country=Thailand\">Thailand</a><br>\r\n\r\n<p>Even in the most closed-minded country you can find new friends easily. Search with OutPersonals for interested partners, contact them and meet onsite. If you don't want to pay for sex, OutPersonals is what you need! Find real people who would be happy to hang out with you.  <a href=\"http://www.outpersonals.com/search/g668502-pct.subst?override=1&age=18-28\">Find new friends even in your hometown - with help of the biggest adult gay dating service</a>!\r\n\r\n\t\t\t<p>Gay sex tourism is travel in gay lifestyle, trip done my males who are intended to take part in gay life of place of destination. Special tourists agencies help gay men to make their travel comfortable.\r\n\t\t\t<p>10% of international tourists are gay or lesbians, accounting for more than 70 million arrivals worldwide. \r\n\t\t\t<p>Travel destinations must be liberal towards gays, have a special infrustructure, probably with gay owners or managers, possibility to find a gay-friendly community. Usually, such places are big cities. Also, it can be a place of some event, as gay parade, festival or some community conference.\r\n\r\n\t\t\t<p>Africa, Asia (most male sex workers in Asian countries (especially Bali and Thailand) service gay or bisexual male clients), Australia, Canada, Europe, Latin and South America, USA suit for such travels almost perfect. If you looking for male prostitutes, you can be interested in katoey or ladyboy phenomenon. There are many transgendered creatures, beautiful or pretty enough, and plenty of crossdressed guys, who can be quite ugly. You have a big chance to meet them everywhere - in beer bar, gogo bar, massage parlor.", "enable_comments": false}}, {"pk": 3, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "History", "url": "/History.html", "template_name": "", "sites": [1], "content": "<p>Historically, it has not been uncommon to find societies that have advocated having multiple sexual partners. Furthermore both royalty and nobility in many cultures had consorts and concubines. Ancient Rome has been notable (if not infamous) for its enthusiastic acceptance of orgies and alternative sexual practices. However, though contemporary swingers celebrate those ideals, the actual practice of swinging in the 20th century began differently.</p>\r\n<p>According to Terry Gould's <i>The Lifestyle: A Look at the Erotic Rites of Swingers</i> (ISBN 1-55209-482-0), swinging began among U.S. Air Force pilots and their wives during World War II. In this small community, the mortality rate among pilots was significantly high. Gould reports that a close bond between pilots arose, with the implication that the husbands would protect and care for all the wives as their own, both emotionally and sexually, if the husbands were away or lost.</p>\r\n<p>This historical narrative is debatable, however, since it would have been highly unusual for servicemen's wives to accompany them on any foreign tours of duty. Other sources point to American Air Force pilots stationed in the California desert as the original participants in modern swinging. Though the exact beginnings are not agreed upon, it is widely assumed that swinging began amongst American military communities in the 1950s.</p>\r\n<p>By the time the Korean War ended, these groups had spread from the bases to the nearby suburbs. The media picked up on them in 1957 and promptly dubbed the phenomenon \"wife-swapping.\"</p>\r\n<p>It wasn't until the 1960s in Berkeley, California that the first organization, \"Sexual Freedom League\", for swingers was opened. Ultimately, an umbrella organization called the North American Swing Club Association (NASCA) (now NASCA International) was formed to encourage accurate information about swinging lifestyles all across America.</p>", "enable_comments": false}}, {"pk": 9, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Hot Wife. Cuckold", "url": "/Hot-Wife.html", "template_name": "", "sites": [1], "content": "<p>The term <b>hot wife</b> refers to a married woman who has sex with men other than her spouse, with the husband's consent. In most cases the husbands take a vicarious pleasure in their wives enjoyment, or enjoy watching, hearing, or knowing about their wives' adventures. (See: Compersion). Husbands may also take part by engaging in threesomes, or arranging dates for their wives.</p>\r\n<p>A distinct subculture of <strike>hotwiving</strike> hotwifing   is cuckolding. This subculture is generally defined as a subgenre in which emphasis is placed upon the sexual humiliation of role reversal, with the woman free to flaunt her sexuality and show blatent enjoyment, and the husband restricted to a passive or subordinated role, possibly involving erotic sexual denial.</p>", "enable_comments": false}}, {"pk": 23, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "When it's illegal", "url": "/illegal.html", "template_name": "", "sites": [4], "content": "\t\t<h1>When it's illegal</h1>\r\n\r\n<p>Find a partner for sex in:<br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=United%20States\">United States</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Canada\">Canada</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Australia\">Australia</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Germany\">Germany</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Cambodia\">Cambodia</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Brazil\">Brazil</a><br>\r\n\r\n\r\n<p>There is nothing illegal in looking for adult partners online and meeting them in real life! You can get the optimal results and list of those you want to date with - in short time. <a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M\">Use AdultFriendFinder - the biggest and most popular dating service</a>!\r\n\r\n\t\t\t<p>In many countries selling sex is illegal. In spite of this, prostitution is not viewed with the same contempt as other crimes. It's often regarded as question of moral, disadvantage of human nature, that you better not talk about, that should be hidden from public. \r\n\r\n\t\t\t<p>Often the term \"sex tourism\" is wrongly interchanged with the term \"child sex tourism\". Thousands of tourists travel abroad with ame to have sex with or take porn photos of kids. Traveling to a foreign country in search of sex become the commercial-sexual exploitation of women and children. Brothels  in developing countries can employ girls and guys ages 7 to 17. More than a million children enter the sex trade each year.\r\n\r\n\t\t\t<p>Several countries have severe laws making child sexual abuse a serious offense, for their nationals or inhabitants even if practiced abroad and even if it is not forbidden by the laws of the foreign country.", "enable_comments": false}}, {"pk": 19, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Lesbian sex tourism", "url": "/lesbian.html", "template_name": "", "sites": [4], "content": "\t\t<h1>Lesbian Sex Tourism</h1>\r\n\r\n<p>Meet lesbian women of:<br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-F&country=Thailand\">Thailand</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-F&country=United%20States\">United States</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-F&country=Bali\">Bali</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-F&country=Dominica\">Dominica</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-F&country=France\">France</a><br>\r\n\r\n<p>Not in every country you can find lesbian girls, whether they are after money or romance. But you can have a dream journey - seek girls online. <a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-F\">AdultFriendFinder will sponsor you with dozens and even hundreds of potential partners - check now</a>!\r\n\r\n\t\t\t<p>Lesbian sex tourism is spreaded in Lesbos (Mytilini) in Greece; Bangkok and Pattaya in Thailand, and on Bali in Indonesia.\r\n\t\t\t<p>Most female sex workers in Asian countries service lesbian or bisexual women.", "enable_comments": false}}, {"pk": 25, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Movies", "url": "/movies.html", "template_name": "", "sites": [4], "content": "\t\t\t<h1>Movies about sex tourism</h1>\r\n\t\t\t<ul>\r\n\t\t\t\t<li>Heading South (Vers le Sud)\r\n\t\t\t\t<li>\"Stella' the Movie Attracting Single Women to Jamaica.\"\r\n\t\t\t<ul>\r\n", "enable_comments": false}}, {"pk": 5, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Organizations", "url": "/Organizations.html", "template_name": "", "sites": [1], "content": "<p>Certain <b>Lifestyle</b> activities are highly organized. There are over 3,000 swinging clubs worldwide. Most major cities in North America and western Europe have at least one <b>swingers' club</b> in a permanent location although they often keep a low profile to avoid negative attention. Swingers also meet through lifestyle magazines, personal ads, swinging house parties, and Internet sites.</p>\r\n<p>Clubs can refer to a physical location or building. In this context, clubs are typically divided into \"on-premise\" clubs, where sexual activity may happen then and there at the club, and \"off-premise\" clubs where sexual activity is not allowed at the club, but may be arranged at a near-by location. \"Clubs\" also may refer to the group that organizes the Lifestyle-related events in a particular area.</p>\r\n<p>In the USA, many swinging clubs follow a bar or nightclub format, sometimes renting an entire existing bar for scheduled events, frequently termed a venue <b>takeover</b>. This is normally done to avoid interaction with non-Lifestyle segments of the population, and once again to avoid unwanted negative attention. This often relegates these activities to suburbia on the weekend, where bars in large industrial parks which attract a mainstream clientele during weekdays would otherwise sit empty or closed on weekends when offices shut down. On-premise clubs usually have a similar format. One notable exception to this is that most on-premise clubs do not serve alcohol, asking participants instead to bring their own because of the restrictive laws commonly in place regarding sexual activity and the presence of alcoholic beverages. Concordantly, the vast majority of swinging clubs do not advertise as such due to the strict moral climate in the United States. Another format is the swinger party. Usually in a home where parking may require a shuttle from another location if the home resides within a suburban area. A home that is usually suitable may have a hot tub, a pool, several bedrooms, and an assortment of sex furniture such as a sex swing, a stripper pole, a dance floor, or a BDSM dungeon. Within the party atmosphere condoms, lube and breath mints may be readily available throughout the house. Sometimes the host may hold events such as a striptease or dance contest, a flogging or other BDSM demonstration.</p>\r\n<p>In Europe off-premises clubs are rare and the majority of swinging venues allow sexual contact and serve alcohol. There are three standard formats: the bar/nightclub, usually smaller, in city centres and focused around a dance floor; the spa format which has pools, Jacuzzis, saunas and steam rooms and where people strip on entry; and the country club format, which is out-of-town, usually serves a free buffet and may include elements of the first two as well as offering large play spaces.</p>\r\n<p>A large amount of swinging activity is organised via the Internet, where there are countless different sites with personals, listings and local information. To many couples, the swinging lifestyle and the clubs can be as much a social venue as a sexual one. Like many sexual sub-cultures, there can be very much a community atmosphere, and the greater communication allowed by the Internet has fostered this sense.</p>", "enable_comments": false}}, {"pk": 10, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Polyamory", "url": "/Polyamory.html", "template_name": "", "sites": [1], "content": "<p>Polyamory is a term that contrasts with monogamy, for the notion that long term full and intimate relationships need not be sexually or emotionally exclusive. So-called poly lifestyles vary, with some being open relationships and others less so.</p>\r\n<p>There is not necessarily a great degree of overlap between swinging and polyamory communities, as they are different outlooks. In swinging the forming of deeper emotional relationships are not the norm and are considered a rarity.</p>", "enable_comments": false}}, {"pk": 4, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Research", "url": "/Research.html", "template_name": "", "sites": [1], "content": "<p>Some subjective scientific research into swinging has been conducted in the USA since the late 1960s. The most recent study, based on an Internet questionnaire addressed to visitors of lifestyle-related sites, found swingers are happier in their relationships than the norm. </p>\r\n<ul>\r\n<li>60% of swingers said that swinging improved their relationship and only 1.7% said it made their relationship less happy. Half of those who rated their relationship very happy before becoming swingers maintained it had become even happier.</li>\r\n<li>90% of those with less happy relationships said swinging improved them.</li>\r\n<li>Almost 70% of swingers claimed no problem with controlling jealousy, around a quarter admitted \"I have difficulty controlling jealousy when swinging\" to be somewhat true but only 6% said this was \"Yes, Very Much\" true.</li>\r\n<li>Swingers rate themselves happier (59% against 32% very happy) and their lives much more exciting (76% against 54% exciting) than does the rest of the population, by surprisingly large margins.</li>\r\n</ul>\r\n<p>There was no difference between the responses of men and women, although more males (70%) than females completed the survey.</p>\r\n<p>This study, while enlightening, is of limited accuracy of the swinging population as a whole, due to its self-selected sampling technique. Internet-based sampling procedures create a substantial potential for bias. It is likely that those swinging couples who had stronger relationships were more motivated to complete the questionnaire. Alternatively, the stress that swinging may place on a marriage means that only those with higher than average levels of commitment to their partners are able to remain married whilst swinging. Couples that have jealousy or strife issues caused by swinging will not usually stay in the swinging lifestyle and thus would have been unlikely to respond.</p>\r\n<p>ABC News reporter John Stossel produced an investigative report into the lifestyle. Stossel reported that over 4 million people are swingers, according to estimates by the Kinsey Institute and other researchers. He also cited Terry Gould's research, in which Gould concluded that \"couples swing in order to <i>not</i> cheat on their partners.\" When Stossel asked swinging couples whether they worry that their spouse will \"find they like someone else better\", one male interviewee replied, \"People in the swinging community swing for a reason. They don't swing to go out and find a new wife;\" while a woman interviewee asserted, \"It makes women more confident -- that they are the ones in charge.\" Stossel interviewed 12 marriage counselors about the lifestyle. According to Stossel, \"not one of them said don't do it\", though some also said \"getting sexual thrills outside of marriage can threaten a marriage\". Nevertheless, the swingers whom Stossel interviewed claimed that \"their marriages are stronger because they don't have affairs and they don't lie to each other.\"</p>", "enable_comments": false}}, {"pk": 17, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Romance tourism", "url": "/romance.html", "template_name": "", "sites": [4], "content": "\t\t<h1>Romance tourism</h1>\r\n\r\n<p>Meet someone in:<br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&pg=1&country=Russia\">Russia</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&pg=1&country=Cambodia\">Cambodia</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&pg=1&country=Australia\">Australia</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&pg=1&country=Canada\">Canada</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&pg=1&country=United%20States\">United States</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&pg=1&country=Italy\">Italy</a><br>\r\n\r\n<p>Serious relationships or one-night flick - people are different and want different things. The one thing connect them - they place their ads at AdultFriendFinder! <a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M\">Meet your future partner there, choose parameters and go</a>!\r\n\r\n\t\t\t<p>Sex tourism often is concourse of circumstances. Tourists, women especially, don't aim to plain sex, human is a intelligent being, after all. Often relations in resorts include mutual affection and can be called romantic.\r\n\t\t\t<p>Some tourists are interested in serious, long-term relationship. That's the weakness numerous giggolos of developing countries play on. Many Asian bar-girls and just prostitutes use the same trick, trying to convince a man that she's not a prostitute, that she loves him madly and so on. These relationships last after a tourist come back to home. Both parts write e-mails, sms, and \"new love\" keep being supported with cheques and gifts. Prostitutes who get money from men abroad to live normal life without prostitution keep doing their job. Such women often have husband of the same nationalaty as they are, who don't have a work and don't mind what she does since she earns money with it.", "enable_comments": false}}, {"pk": 22, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Safety first", "url": "/safety.html", "template_name": "", "sites": [4], "content": "\t\t<h1>Safety First</h1>\r\n\r\n<p>Find a lover in:<br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=United%20States\">United States</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Canada\">Canada</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Australia\">Australia</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Germany\">Germany</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Cambodia\">Cambodia</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Brazil\">Brazil</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Italy\">Italy</a><br>\r\n\r\n<p>Find sex partners before you go travel! Make sure that your contacts will be safe. <a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M\">Travel with pleasure and safety, meet your new friends with AdultFriendFinder</a>!\r\n\r\n\t\t\t<p>The first and the most important that you should know: there are too many diseased sex-workers in developing countries. You should use a condom, but that's not all. Sometimes direct skin-to-skin contact is dangerous. Oral sex without condom is unhealthy and even if you use condom, you still risk to get Hepatitus B, Herpes and other viruses.\r\n\t\t\t<p>Use antiseptics, like Listerine, in case of dubious contact.", "enable_comments": false}}, {"pk": 11, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Selective swinging", "url": "/Selective-swinging.html", "template_name": "", "sites": [1], "content": "<p>Traditionally swinger clubs are accepting of all ages and body types, and the average age of swingers at events tends to be around 45. Younger swingers who wish to swing with their own age group find that this isn't always possible in swinging clubs.</p>\r\n<p>Fever Parties began running parties for affluent under 40s in London in the late 1990s. Other party organisers, such as Lounge Parties in London (who select on looks, but not age) and Belle Baise in the Midlands (who select on looks and age) have sprung up in recent years. These organisations try to elevate themselves from historic swinging clubs by hosting their events in upmarket venues, serving Champagne or cocktails and asking their guests to dress in smart evening attire. Entry to these parties is often competitive and photographs are usually required to demonstrate attractiveness.</p>\r\n<p>Due to the success of these events in the UK, they have subsequently spread to Norway, South Africa, Sweden and the USA. This, more than anything else, has given rise to the term <b>The Lifestyle</b> as a way to encompass all swinging activities, due to the fact that younger couples are somewhat averse to the term \"swingers\" because of its traditional connotations.</p>\r\n<p>'Selective swinging' events include mostly childless, unmarried young graduates and can have average ages as low as the late 20s, whereas traditional swingers events tend to have average ages in the 40s. Selective parties are often referred to as \"exclusive\" or \"elitist\".  Contravening the usual assumption that such organisations are not associated with groups propagating \"family values\", the Fever parties were revealed in June 2003 to be organised by a senior co-ordinator of a British Conservative Party pressure group, Conservatives for Change, who was older than the maximum age allowed to attend his events.</p>\r\n<p>Another factor contributing to this situation is the continued upsurge in growth of Lifestyle-oriented Internet sites. These sites provide much more accessible gateways into Lifestyle activities for people who are curious about swinging. By offering greater flexibility when searching for potential playmates, it becomes possible to look for playmates that specifically match certain characteristics, including location, looks, wealth, and age. In the United States, it is still uncommon to find parties where stringent age requirements are in affect, and most groups remain non-discriminatory. However, the acceptance of 'elite' parties continues to be more common, with couples and single females becoming more and more willing to pay an additional premium to spend time with only a select segment of the swinging population.</p>\r\n<p>The critique of selective swinging among traditional swingers is that it is unethical to discriminate. The growing upsurge interest in selective swinging has given rise to a growing rift between the two groups. Couples who identify with traditional swinging may advertise themselves as \"not Ken and Barbie\" as an implicit rejection of what they perceive to be a superficial ideal of youthful physical attractiveness. The proponents of selective swinging claim an entitlement to peer-group options in this as in other leisure pursuits. A large effort among members of the Lifestyle as a whole is being made to unify the two sub-groups, because arguments between the two are seen as divisive and destructive to the community as a whole.</p>", "enable_comments": false}}, {"pk": 12, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Singles", "url": "/Singles.html", "template_name": "", "sites": [1], "content": "<p>The acceptance of singles at swinging events varies from geographic area to geographic area and event to event. Some swinging \"clubs\" have a policy of allowing only couples and females, but most do allow single men on selected nights. Single females are often admitted at reduced admission price. Parties and private events may differ, however, and are often restricted to couples or couples and single females only.</p>\r\n<p>The reasons for this vary. Most (but certainly not all) of the people who pay to participate in swinger events are male-female couples and most swinging couples are more interested in interacting with other couples or with single women than with single men. Thus, swinger events strive to achieve a balance between male and female participants or have a (usually slightly) larger number of females than males.</p>\r\n<p>A common complaint among swingers is that single men change the tone and nature of event. While outright hostility towards single men is rarely prevalent, an abundance of single males is rarely looked upon favourably in any swinging context. When single males are permitted their numbers are usually limited by high entrance fees or stringent membership requirements.</p>\r\n<p>In the UK, swinging nights which are designed for catering to women who want multiple men are referred to as <i>Greedy Girls' Nights</i> and they are, to all intents and purposes gang bangs. They are often held in swingers' clubs (on less busy nights) or take place as private parties. These are attended by both couples and singles, a proportion of which are sometimes prostitutes.</p>\r\n<p>Some swingers oppose the involvement of any singles of either sex in swinging because of the fear that they might split existing couples. While this might be a fear of some new couples, couples who have been part of the \"Lifestyle\" for some time report that the only way a couple can \"split\" is when one of the couple is looking outside the primary relationship. This is not the norm in a swinger relationship .</p>", "enable_comments": false}}, {"pk": 13, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Swingers and Adult Dating Sites", "url": "/sites.html", "template_name": "", "sites": [1], "content": "", "enable_comments": false}}, {"pk": 21, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Sex tourism for swingers", "url": "/swingers.html", "template_name": "", "sites": [4], "content": "\t\t<h1>Sex tourism for swingers</h1>\r\n\r\n<p>Find swingers in:<br>\r\n<a href=\"http://swingers.adultfriendfinder.com/search/g668502-pct.subst?override=1&show=C-C&country=United%20States\">United States</a><br>\r\n<a href=\"http://swingers.adultfriendfinder.com/search/g668502-pct.subst?override=1&show=C-C&country=Germany\">Germany</a><br>\r\n<a href=\"http://swingers.adultfriendfinder.com/search/g668502-pct.subst?override=1&show=C-C&country=Thailand\">Thailand</a><br>\r\n<a href=\"http://swingers.adultfriendfinder.com/search/g668502-pct.subst?override=1&show=C-C&country=Ukraine\">Ukraine</a><br>\r\n<a href=\"http://swingers.adultfriendfinder.com/search/g668502-pct.subst?override=1&show=C-C&country=Russia\">Russia</a><br>\r\n<a href=\"http://swingers.adultfriendfinder.com/search/g668502-pct.subst?override=1&show=C-C&country=Poland\">Poland</a><br>\r\n\r\n<p>One of the best ways to find sex partners beforehand - contact them online! AdultFriendFinder will make your trip unforgettable and even at home you'll meet new people easily! <a href=\"http://swingers.adultfriendfinder.com/search/g668502-pct.subst?override=1&show=F-M\">Fun and free - try the most popular service</a>!\r\n\r\n<p>Page is under construction.", "enable_comments": false}}, {"pk": 15, "model": "flatpages.flatpage", "fields": {"registration_required": false, "title": "Worst countries for sex tourism", "url": "/worst.html", "template_name": "", "sites": [4], "content": "\t\t\t<h1>Worst countries for sex tourism</h1>\r\n\r\n<p>Ladies looking for sex in:<br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=United%20States\">United States</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=France\">France</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=Egypt\">Egypt</a><br>\r\n<a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M&country=India\">India</a><br>\r\n\r\n<p>Don't be sad if you're going to travel into the country where mongerers have bad luck. Find girls beforehand - with help of AdultFriendFinder! Dozens of naughty women looking for fun in every city, so you won't be frustrated. <a href=\"http://www.adultfriendfinder.com/search/g668502-pct.subst?override=1&age=18-28&show=F-M\">Search for partners with AdultFriendFinder - and happy hunting is guaranteed</a>!\r\n\r\n\t\t\t<h3>USA</h3>\r\n\t\t\t<p>Prostitution there is illegal except for rural areas of Nevada; these have become a sex tourist destination for some Americans. Several large cities are also domestic sex tourist destinations despite legal sanctions on prostitution.\r\n\r\n\t\t\t<h3>Europe, except for The Netherlands</h3>\r\n\t\t\t<p>German, France, England are boring, not much prostitites and prices are high.\r\n\r\n\t\t\t<h3>Arabian countries</h3>\r\n\t\t\t<p>Arabian women wear clothes that can be called revealing and still not go on contact with an unknown man. The better way to have sex would be trying to find a common language with a female tourist.\r\n\r\n\t\t\t<h3>Scandinavia</h3>\r\n\t\t\t<p>Prostitutes in countries of Scandinavia are Russian, Ukrainian and Estonian, rarely Asian. Sex is expensive, available in massage parlors and relax centers.\r\n\r\n\t\t\t<h3>Israel</h3>\r\n\t\t\t<p>Sex workers are mostly mature women or foreigners, sex is expensive and not satisfying. Pretty girls ask too much for the service.\r\n", "enable_comments": false}}, {"pk": 2, "model": "sites.site", "fields": {"domain": "allfetishclubs.org", "name": "allfetishclubs.org"}}, {"pk": 3, "model": "sites.site", "fields": {"domain": "allgayclubs.org", "name": "allgayclubs.org"}}, {"pk": 1, "model": "sites.site", "fields": {"domain": "allswingersclubs.org", "name": "allswingersclubs.org"}}, {"pk": 4, "model": "sites.site", "fields": {"domain": "sex-tourism.org", "name": "Sex Tourism"}}]
